#include "adc.h"
#include "delay.h"		 
//////////////////////////////////////////////////////////////////////////////////	 
//±¾³ÌÐòÖ»¹©Ñ§Ï°Ê¹ÓÃ£¬Î´¾­×÷ÕßÐí¿É£¬²»µÃÓÃÓÚÆäËüÈÎºÎÓÃÍ¾
//ALIENTEK STM32F407¿ª·¢°å
//ADC Çý¶¯´úÂë	   
//ÕýµãÔ­×Ó@ALIENTEK
//¼¼ÊõÂÛÌ³:www.openedv.com
//´´½¨ÈÕÆÚ:2014/5/6
//°æ±¾£ºV1.0
//°æÈ¨ËùÓÐ£¬µÁ°æ±Ø¾¿¡£
//Copyright(C) ¹ãÖÝÊÐÐÇÒíµç×Ó¿Æ¼¼ÓÐÏÞ¹«Ë¾ 2014-2024
//All rights reserved									   
////////////////////////////////////////////////////////////////////////////////// 


//³õÊ¼»¯ADC
//ÕâÀïÎÒÃÇ½öÒÔ¹æÔòÍ¨µÀÎªÀý
//ÎÒÃÇÄ¬ÈÏ½ö¿ªÆôADC1_CH5																	   
void  Adc_Init(void)
{    
	//ÏÈ³õÊ¼»¯IO¿Ú
 	RCC->APB2ENR|=1<<8;    	//Ê¹ÄÜADC1Ê±ÖÓ 
	RCC->AHB1ENR|=1<<0;    	//Ê¹ÄÜPORTAÊ±ÖÓ	  
	GPIO_Set(GPIOA,PIN5,GPIO_MODE_AIN,0,0,GPIO_PUPD_PU);	//PA5,Ä£ÄâÊäÈë,ÏÂÀ­   
	GPIO_Set(GPIOA,PIN4,GPIO_MODE_AIN,0,0,GPIO_PUPD_PU);	//PA5,Ä£ÄâÊäÈë,ÏÂÀ
	
	RCC->APB2RSTR|=1<<8;   	//ADCs¸´Î»
	RCC->APB2RSTR&=~(1<<8);	//¸´Î»½áÊø	 
	ADC->CCR=3<<16;			//ADCCLK=PCLK2/4=84/4=21Mhz,ADCÊ±ÖÓ×îºÃ²»Òª³¬¹ý36Mhz
 	
	ADC1->CR1=0;   			//CR1ÉèÖÃÇåÁã
	ADC1->CR2=0;   			//CR2ÉèÖÃÇåÁã
	ADC1->CR1|=0<<24;      	//12Î»Ä£Ê½
	ADC1->CR1|=0<<8;    	//·ÇÉ¨ÃèÄ£Ê½	
	
	ADC1->CR2&=~(1<<1);    	//µ¥´Î×ª»»Ä£Ê½
 	ADC1->CR2&=~(1<<11);   	//ÓÒ¶ÔÆë	
	ADC1->CR2|=0<<28;    	//Èí¼þ´¥·¢
	
	ADC1->SQR1&=~(0XF<<20);
	ADC1->SQR1|=0<<20;     	//1¸ö×ª»»ÔÚ¹æÔòÐòÁÐÖÐ Ò²¾ÍÊÇÖ»×ª»»¹æÔòÐòÁÐ1 			   
	//ÉèÖÃÍ¨µÀ5µÄ²ÉÑùÊ±¼ä
	ADC1->SMPR2&=~(7<<(3*5));//Í¨µÀ5²ÉÑùÊ±¼äÇå¿Õ	  
 	ADC1->SMPR2|=7<<(3*5); 	//Í¨µÀ5  480¸öÖÜÆÚ,Ìá¸ß²ÉÑùÊ±¼ä¿ÉÒÔÌá¸ß¾«È·¶È	 
 	ADC1->CR2|=1<<0;	   	//¿ªÆôAD×ª»»Æ÷	  
}				  
//»ñµÃADCÖµ
//ch:Í¨µÀÖµ 0~16
//·µ»ØÖµ:×ª»»½á¹û
u16 Get_Adc(u8 ch)   
{
	//ÉèÖÃ×ª»»ÐòÁÐ	  		 
	ADC1->SQR3&=0XFFFFFFE0;//¹æÔòÐòÁÐ1 Í¨µÀch
	ADC1->SQR3|=ch;		  			    
	ADC1->CR2|=1<<30;       //Æô¶¯¹æÔò×ª»»Í¨µÀ 
	while(!(ADC1->SR&1<<1));//µÈ´ý×ª»»½áÊø	 	   
	return ADC1->DR;		//·µ»ØadcÖµ	
}
//»ñÈ¡Í¨µÀchµÄ×ª»»Öµ£¬È¡times´Î,È»ºóÆ½¾ù 
//ch:Í¨µÀ±àºÅ
//times:»ñÈ¡´ÎÊý
//·µ»ØÖµ:Í¨µÀchµÄtimes´Î×ª»»½á¹ûÆ½¾ùÖµ
u16 Get_Adc_Average(u8 ch,u8 times)
{
	u32 temp_val=0;
	u8 t;
	for(t=0;t<times;t++)
	{
		temp_val+=Get_Adc(ch);
		delay_ms(5);
	}
	return temp_val/times;
}  









